import { Card, Form, Button } from "@douyinfe/semi-ui";
import logo from "../../assets/Logo.png";
import "./index.scss";
function Login() {
  const handleSubmit = (values) => {
    console.log(values);
    // window.location.href =
    //   "https://link.sast.fun/login?redirect=/auth?[%22client_id=4d6502e2-64e8-41fb-b1ff-b8374ed2f0d6%22,%22code_challenge=YillThSRrGTj6mXqFfDPinX7G35qEQ1QEyWV6PDSEuc=%22,%22code_challenge_method=S256%22,%22redirect_uri=https://localhost:3000/api/auth/callback/sastlink%22,%22response_type=code%22,%22scope=all%22,%22state=IUIAhUgiwvc8mlO25SerwjtLN20sd-GxlLUUQPSkeSg%22]";
  };

  const AuthorizedLink = () => {
    console.log("授权link登录");
    //授权link逻辑
  };

  const AuthorizedWeChat = () => {
    console.log("授权WeChat登录");
    //授权wechat逻辑
  };

  const AuthorizedTicket = () => {
    console.log("授权二维码登录");
    //授权ticket逻辑
  };
  return (
    <div className="login">
      <Card className="login-container">
        <img className="login-logo" alt="loginLogo" src={logo} />
        <Form className="login-box" onSubmit={(values) => handleSubmit(values)}>
          {/* 通过formState获得用户输入信息，JSON.stringify(formState)格式为json格式 */}
          {({ formState, values, formApi }) => (
            <>
              <Form.Input
                className="formInput"
                field="username"
                label="账号"
                placeholder="请输入账号"
                autoComplete="off"
              />
              <Form.Input
                className="formInput"
                mode="password"
                field="password"
                label="密码"
                placeholder="请输入密码"
                autoComplete="off"
              />
              {/* <code style={{ marginTop: 24 }}>{JSON.stringify(formState)}</code> */}
              <Button
                className="formButton"
                theme="solid"
                htmlType="submit"
                type="tertiary"
              >
                登录
              </Button>
              <div className="formAuthorizedButtonContainer">
                <button
                  className="formAuthorizedButtonLink"
                  theme="solid"
                  name="link"
                  onClick={AuthorizedLink}
                >
                  <span>Link</span>
                </button>
                <button
                  className="formAuthorizedButtonWeChat"
                  theme="solid"
                  name="WeChat"
                  onClick={AuthorizedWeChat}
                >
                  <svg
                    t="1700735149726"
                    class="icon"
                    viewBox="0 0 1024 1024"
                    version="1.1"
                    xmlns="http://www.w3.org/2000/svg"
                    p-id="8441"
                    width="200"
                    height="200"
                  >
                    <path
                      d="M690.1 377.4c5.9 0 11.8 0.2 17.6 0.5-24.4-128.7-158.3-227.1-319.9-227.1C209 150.8 64 271.4 64 420.2c0 81.1 43.6 154.2 111.9 203.6 5.5 3.9 9.1 10.3 9.1 17.6 0 2.4-0.5 4.6-1.1 6.9-5.5 20.3-14.2 52.8-14.6 54.3-0.7 2.6-1.7 5.2-1.7 7.9 0 5.9 4.8 10.8 10.8 10.8 2.3 0 4.2-0.9 6.2-2l70.9-40.9c5.3-3.1 11-5 17.2-5 3.2 0 6.4 0.5 9.5 1.4 33.1 9.5 68.8 14.8 105.7 14.8 6 0 11.9-0.1 17.8-0.4-7.1-21-10.9-43.1-10.9-66 0-135.8 132.2-245.8 295.3-245.8z m-194.3-86.5c23.8 0 43.2 19.3 43.2 43.1s-19.3 43.1-43.2 43.1c-23.8 0-43.2-19.3-43.2-43.1s19.4-43.1 43.2-43.1z m-215.9 86.2c-23.8 0-43.2-19.3-43.2-43.1s19.3-43.1 43.2-43.1 43.2 19.3 43.2 43.1-19.4 43.1-43.2 43.1z"
                      p-id="8442"
                      fill="#09bb07"
                    ></path>
                    <path
                      d="M866.7 792.7c56.9-41.2 93.2-102 93.2-169.7 0-124-120.8-224.5-269.9-224.5-149 0-269.9 100.5-269.9 224.5S540.9 847.5 690 847.5c30.8 0 60.6-4.4 88.1-12.3 2.6-0.8 5.2-1.2 7.9-1.2 5.2 0 9.9 1.6 14.3 4.1l59.1 34c1.7 1 3.3 1.7 5.2 1.7 2.4 0 4.7-0.9 6.4-2.6 1.7-1.7 2.6-4 2.6-6.4 0-2.2-0.9-4.4-1.4-6.6-0.3-1.2-7.6-28.3-12.2-45.3-0.5-1.9-0.9-3.8-0.9-5.7 0.1-5.9 3.1-11.2 7.6-14.5zM600.2 587.2c-19.9 0-36-16.1-36-35.9 0-19.8 16.1-35.9 36-35.9s36 16.1 36 35.9c0 19.8-16.2 35.9-36 35.9z m179.9 0c-19.9 0-36-16.1-36-35.9 0-19.8 16.1-35.9 36-35.9s36 16.1 36 35.9c-0.1 19.8-16.2 35.9-36 35.9z"
                      p-id="8443"
                      fill="#09bb07"
                    ></path>
                  </svg>
                </button>
                <button
                  className="formAuthorizedButtonTicket"
                  theme="solid"
                  name="Ticket"
                  onClick={AuthorizedTicket}
                >
                  <svg
                    t="1700736053365"
                    class="icon"
                    viewBox="0 0 1024 1024"
                    version="1.1"
                    xmlns="http://www.w3.org/2000/svg"
                    p-id="14903"
                    width="200"
                    height="200"
                  >
                    <path
                      d="M737.673809 863.903745 737.673809 800.13335 672.503531 800.13335 672.503531 863.949794ZM834.943157 863.949794c15.954367 0 29.006637-13.053294 29.006637-29.006637l0-34.808784-62.461587 0 0 63.769372M415.311891 223.865627l0 191.447287L223.864604 415.312914 223.864604 223.865627 415.311891 223.865627M450.120674 160.050206 189.05582 160.050206c-15.953344 0-29.006637 13.053294-29.006637 29.006637l0 261.063831c0 15.954367 13.053294 29.006637 29.006637 29.006637l261.063831 0c15.953344 0 29.006637-13.053294 29.006637-29.006637L479.126288 189.056843C479.127312 173.1035 466.074018 160.050206 450.120674 160.050206L450.120674 160.050206zM319.588759 319.589782m-31.907711 0a31.181 31.181 0 1 0 63.815421 0 31.181 31.181 0 1 0-63.815421 0ZM800.134373 223.865627l0 191.447287L608.688109 415.312914 608.688109 223.865627 800.134373 223.865627M834.943157 160.050206 573.879326 160.050206c-15.954367 0-29.006637 13.053294-29.006637 29.006637l0 261.063831c0 15.954367 13.053294 29.006637 29.006637 29.006637l261.063831 0c15.954367 0 29.006637-13.053294 29.006637-29.006637L863.949794 189.056843C863.950817 173.1035 850.897523 160.050206 834.943157 160.050206L834.943157 160.050206zM704.411241 319.589782m-31.907711 0a31.181 31.181 0 1 0 63.815421 0 31.181 31.181 0 1 0-63.815421 0ZM415.311891 608.687086l0 191.447287L223.864604 800.134373 223.864604 608.687086 415.311891 608.687086M450.120674 544.871665 189.05582 544.871665c-15.953344 0-29.006637 13.053294-29.006637 29.006637l0 261.063831c0 15.954367 13.053294 29.006637 29.006637 29.006637l261.063831 0c15.954367 0 29.006637-13.053294 29.006637-29.006637L479.126288 573.878303C479.127312 557.924959 466.074018 544.871665 450.120674 544.871665L450.120674 544.871665zM319.588759 704.410218m-31.907711 0a31.181 31.181 0 1 0 63.815421 0 31.181 31.181 0 1 0-63.815421 0ZM834.943157 544.871665l-35.579333 0 0 127.630842-63.815421 0L735.548402 544.871665 573.879326 544.871665c-15.954367 0-29.006637 13.053294-29.006637 29.006637l0 261.063831c0 15.954367 13.053294 29.006637 29.006637 29.006637l34.808784 0 0-63.815421 0-63.815421 0-63.815421 63.815421 0 0 63.815421L863.950817 736.317928l0-162.439626C863.950817 557.924959 850.897523 544.871665 834.943157 544.871665z"
                      fill="#2c2c2c"
                      p-id="14904"
                    ></path>
                  </svg>
                </button>
              </div>
            </>
          )}
        </Form>
      </Card>
    </div>
  );
}

export default Login;
